package gd.eggs.net.protocol.core
{

	/**
	 * ...
	 * @author Dukobpa3
	 */
	public class BaseCommandSet
	{
		//=====================================================================
		//	CONSTANTS
		//=====================================================================

		//=====================================================================
		//	PARAMETERS
		//=====================================================================
		protected var _commandDict:CommandDict = CommandDict.getInstance();


		//=====================================================================
		//	CONSTRUCTOR, INIT
		//=====================================================================
		public function BaseCommandSet()
		{
			/** Первым делом добавим дефолтный обработчик */
			_commandDict.addItem(0, "default", BaseProtoData, BaseProtoData, procDefaultData);

		}

		//=====================================================================
		//	PUBLIC
		//=====================================================================
		//-----------------------------
		//	Обработка незарегистрированных команд
		//-----------------------------
		public function init():void
		{
			throw new Error("abstract method, need to override");
		}

		public function procDefaultData(data:Object):void
		{
			throw new Error("Unspecified command, need to override default parser");
		}

		//=====================================================================
		//	PRIVATE
		//=====================================================================

		//=====================================================================
		//	HANDLERS
		//=====================================================================

		//=====================================================================
		//	ACCESSORS
		//=====================================================================
	}

}